evidence/testing/step3-test-pyramid/test3-load-baseline-output.txt

         /\      Grafana   /ظ╛ظ╛/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ظ╛ظ╛\ 
  /          \   |   (  |  (ظ╛)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: tests/performance/load-baseline.js
        output: json (evidence/testing/step3-test-pyramid/test3-load-baseline-results-fixed.json)

     scenarios: (100.00%) 1 scenario, 10 max VUs, 5m30s max duration (incl. graceful stop):
              * default: Up to 10 looping VUs for 5m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)

time="2026-05-04T08:58:24+03:00" level=info msg="≡ا¤ Login attempt: 200" source=console
time="2026-05-04T08:58:24+03:00" level=info msg="ظ£à Authentication successful - Token received" source=console

running (0m01.0s), 01/10 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 01/10 VUs  0m00.7s/5m00.0s

running (0m02.0s), 01/10 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 01/10 VUs  0m01.7s/5m00.0s

running (0m03.0s), 01/10 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 01/10 VUs  0m02.7s/5m00.0s

running (0m04.0s), 01/10 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 01/10 VUs  0m03.7s/5m00.0s

running (0m05.0s), 01/10 VUs, 1 complete and 0 interrupted iterations
default   [   2% ] 01/10 VUs  0m04.7s/5m00.0s

running (0m06.0s), 01/10 VUs, 2 complete and 0 interrupted iterations
default   [   2% ] 01/10 VUs  0m05.7s/5m00.0s

running (0m07.0s), 02/10 VUs, 2 complete and 0 interrupted iterations
default   [   2% ] 02/10 VUs  0m06.7s/5m00.0s

running (0m08.0s), 02/10 VUs, 3 complete and 0 interrupted iterations
default   [   3% ] 02/10 VUs  0m07.7s/5m00.0s

running (0m09.0s), 02/10 VUs, 4 complete and 0 interrupted iterations
default   [   3% ] 02/10 VUs  0m08.7s/5m00.0s

running (0m10.0s), 02/10 VUs, 5 complete and 0 interrupted iterations
default   [   3% ] 02/10 VUs  0m09.7s/5m00.0s

running (0m11.0s), 02/10 VUs, 5 complete and 0 interrupted iterations
default   [   4% ] 02/10 VUs  0m10.7s/5m00.0s

running (0m12.0s), 02/10 VUs, 7 complete and 0 interrupted iterations
default   [   4% ] 02/10 VUs  0m11.7s/5m00.0s

running (0m13.0s), 02/10 VUs, 8 complete and 0 interrupted iterations
default   [   4% ] 02/10 VUs  0m12.7s/5m00.0s

running (0m14.0s), 03/10 VUs, 9 complete and 0 interrupted iterations
default   [   5% ] 03/10 VUs  0m13.7s/5m00.0s

running (0m15.0s), 03/10 VUs, 9 complete and 0 interrupted iterations
default   [   5% ] 03/10 VUs  0m14.7s/5m00.0s

running (0m16.0s), 03/10 VUs, 11 complete and 0 interrupted iterations
default   [   5% ] 03/10 VUs  0m15.7s/5m00.0s

running (0m17.0s), 03/10 VUs, 13 complete and 0 interrupted iterations
default   [   6% ] 03/10 VUs  0m16.7s/5m00.0s

running (0m18.0s), 03/10 VUs, 15 complete and 0 interrupted iterations
default   [   6% ] 03/10 VUs  0m17.7s/5m00.0s

running (0m19.0s), 03/10 VUs, 17 complete and 0 interrupted iterations
default   [   6% ] 03/10 VUs  0m18.7s/5m00.0s

running (0m20.0s), 03/10 VUs, 18 complete and 0 interrupted iterations
default   [   7% ] 03/10 VUs  0m19.7s/5m00.0s

running (0m21.0s), 04/10 VUs, 19 complete and 0 interrupted iterations
default   [   7% ] 04/10 VUs  0m20.7s/5m00.0s

running (0m22.0s), 04/10 VUs, 20 complete and 0 interrupted iterations
default   [   7% ] 04/10 VUs  0m21.7s/5m00.0s

running (0m23.0s), 04/10 VUs, 23 complete and 0 interrupted iterations
default   [   8% ] 04/10 VUs  0m22.7s/5m00.0s

running (0m24.0s), 04/10 VUs, 24 complete and 0 interrupted iterations
default   [   8% ] 04/10 VUs  0m23.7s/5m00.0s

running (0m25.0s), 04/10 VUs, 27 complete and 0 interrupted iterations
default   [   8% ] 04/10 VUs  0m24.7s/5m00.0s

running (0m26.0s), 04/10 VUs, 28 complete and 0 interrupted iterations
default   [   9% ] 04/10 VUs  0m25.7s/5m00.0s

running (0m27.0s), 05/10 VUs, 32 complete and 0 interrupted iterations
default   [   9% ] 05/10 VUs  0m26.7s/5m00.0s

running (0m28.0s), 05/10 VUs, 33 complete and 0 interrupted iterations
default   [   9% ] 05/10 VUs  0m27.7s/5m00.0s

running (0m29.0s), 05/10 VUs, 36 complete and 0 interrupted iterations
default   [  10% ] 05/10 VUs  0m28.7s/5m00.0s

running (0m30.0s), 05/10 VUs, 39 complete and 0 interrupted iterations
default   [  10% ] 05/10 VUs  0m29.7s/5m00.0s

running (0m31.0s), 05/10 VUs, 40 complete and 0 interrupted iterations
default   [  10% ] 05/10 VUs  0m30.7s/5m00.0s

running (0m32.0s), 05/10 VUs, 44 complete and 0 interrupted iterations
default   [  11% ] 05/10 VUs  0m31.7s/5m00.0s

running (0m33.0s), 05/10 VUs, 45 complete and 0 interrupted iterations
default   [  11% ] 05/10 VUs  0m32.7s/5m00.0s

running (0m34.0s), 06/10 VUs, 48 complete and 0 interrupted iterations
default   [  11% ] 06/10 VUs  0m33.7s/5m00.0s

running (0m35.0s), 06/10 VUs, 51 complete and 0 interrupted iterations
default   [  12% ] 06/10 VUs  0m34.7s/5m00.0s

running (0m36.0s), 06/10 VUs, 54 complete and 0 interrupted iterations
default   [  12% ] 06/10 VUs  0m35.7s/5m00.0s

running (0m37.0s), 06/10 VUs, 56 complete and 0 interrupted iterations
default   [  12% ] 06/10 VUs  0m36.7s/5m00.0s

running (0m38.0s), 06/10 VUs, 61 complete and 0 interrupted iterations
default   [  13% ] 06/10 VUs  0m37.7s/5m00.0s

running (0m39.0s), 06/10 VUs, 62 complete and 0 interrupted iterations
default   [  13% ] 06/10 VUs  0m38.7s/5m00.0s

running (0m40.0s), 06/10 VUs, 66 complete and 0 interrupted iterations
default   [  13% ] 06/10 VUs  0m39.7s/5m00.0s

running (0m41.0s), 07/10 VUs, 68 complete and 0 interrupted iterations
default   [  14% ] 07/10 VUs  0m40.7s/5m00.0s

running (0m42.0s), 07/10 VUs, 70 complete and 0 interrupted iterations
default   [  14% ] 07/10 VUs  0m41.7s/5m00.0s

running (0m43.0s), 07/10 VUs, 75 complete and 0 interrupted iterations
default   [  14% ] 07/10 VUs  0m42.7s/5m00.0s

running (0m44.0s), 07/10 VUs, 77 complete and 0 interrupted iterations
default   [  15% ] 07/10 VUs  0m43.7s/5m00.0s

running (0m45.0s), 07/10 VUs, 81 complete and 0 interrupted iterations
default   [  15% ] 07/10 VUs  0m44.7s/5m00.0s

running (0m46.0s), 07/10 VUs, 83 complete and 0 interrupted iterations
default   [  15% ] 07/10 VUs  0m45.7s/5m00.0s

running (0m47.0s), 08/10 VUs, 87 complete and 0 interrupted iterations
default   [  16% ] 08/10 VUs  0m46.7s/5m00.0s

running (0m48.0s), 08/10 VUs, 92 complete and 0 interrupted iterations
default   [  16% ] 08/10 VUs  0m47.7s/5m00.0s

running (0m49.0s), 08/10 VUs, 93 complete and 0 interrupted iterations
default   [  16% ] 08/10 VUs  0m48.7s/5m00.0s

running (0m50.0s), 08/10 VUs, 97 complete and 0 interrupted iterations
default   [  17% ] 08/10 VUs  0m49.7s/5m00.0s

running (0m51.0s), 08/10 VUs, 103 complete and 0 interrupted iterations
default   [  17% ] 08/10 VUs  0m50.7s/5m00.0s

running (0m52.0s), 08/10 VUs, 107 complete and 0 interrupted iterations
default   [  17% ] 08/10 VUs  0m51.7s/5m00.0s

running (0m53.0s), 08/10 VUs, 109 complete and 0 interrupted iterations
default   [  18% ] 08/10 VUs  0m52.7s/5m00.0s

running (0m54.0s), 09/10 VUs, 113 complete and 0 interrupted iterations
default   [  18% ] 09/10 VUs  0m53.7s/5m00.0s

running (0m55.0s), 09/10 VUs, 117 complete and 0 interrupted iterations
default   [  18% ] 09/10 VUs  0m54.7s/5m00.0s

running (0m56.0s), 09/10 VUs, 121 complete and 0 interrupted iterations
default   [  19% ] 09/10 VUs  0m55.7s/5m00.0s

running (0m57.0s), 09/10 VUs, 127 complete and 0 interrupted iterations
default   [  19% ] 09/10 VUs  0m56.7s/5m00.0s

running (0m58.0s), 09/10 VUs, 129 complete and 0 interrupted iterations
default   [  19% ] 09/10 VUs  0m57.7s/5m00.0s

running (0m59.0s), 09/10 VUs, 132 complete and 0 interrupted iterations
default   [  20% ] 09/10 VUs  0m58.7s/5m00.0s

running (1m00.0s), 09/10 VUs, 137 complete and 0 interrupted iterations
default   [  20% ] 09/10 VUs  0m59.7s/5m00.0s

running (1m01.0s), 10/10 VUs, 141 complete and 0 interrupted iterations
default   [  20% ] 10/10 VUs  1m00.7s/5m00.0s

running (1m02.0s), 10/10 VUs, 146 complete and 0 interrupted iterations
default   [  21% ] 10/10 VUs  1m01.7s/5m00.0s

running (1m03.0s), 10/10 VUs, 149 complete and 0 interrupted iterations
default   [  21% ] 10/10 VUs  1m02.7s/5m00.0s

running (1m04.0s), 10/10 VUs, 155 complete and 0 interrupted iterations
default   [  21% ] 10/10 VUs  1m03.7s/5m00.0s

running (1m05.0s), 10/10 VUs, 160 complete and 0 interrupted iterations
default   [  22% ] 10/10 VUs  1m04.7s/5m00.0s

running (1m06.0s), 10/10 VUs, 164 complete and 0 interrupted iterations
default   [  22% ] 10/10 VUs  1m05.7s/5m00.0s

running (1m07.0s), 10/10 VUs, 167 complete and 0 interrupted iterations
default   [  22% ] 10/10 VUs  1m06.7s/5m00.0s

running (1m08.0s), 10/10 VUs, 172 complete and 0 interrupted iterations
default   [  23% ] 10/10 VUs  1m07.7s/5m00.0s

running (1m09.0s), 10/10 VUs, 176 complete and 0 interrupted iterations
default   [  23% ] 10/10 VUs  1m08.7s/5m00.0s

running (1m10.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
default   [  23% ] 10/10 VUs  1m09.7s/5m00.0s

running (1m11.0s), 10/10 VUs, 186 complete and 0 interrupted iterations
default   [  24% ] 10/10 VUs  1m10.7s/5m00.0s

running (1m12.0s), 10/10 VUs, 190 complete and 0 interrupted iterations
default   [  24% ] 10/10 VUs  1m11.7s/5m00.0s

running (1m13.0s), 10/10 VUs, 192 complete and 0 interrupted iterations
default   [  24% ] 10/10 VUs  1m12.7s/5m00.0s

running (1m14.0s), 10/10 VUs, 197 complete and 0 interrupted iterations
default   [  25% ] 10/10 VUs  1m13.7s/5m00.0s

running (1m15.0s), 10/10 VUs, 202 complete and 0 interrupted iterations
default   [  25% ] 10/10 VUs  1m14.7s/5m00.0s

running (1m16.0s), 10/10 VUs, 206 complete and 0 interrupted iterations
default   [  25% ] 10/10 VUs  1m15.7s/5m00.0s

running (1m17.0s), 10/10 VUs, 214 complete and 0 interrupted iterations
default   [  26% ] 10/10 VUs  1m16.7s/5m00.0s

running (1m18.0s), 10/10 VUs, 217 complete and 0 interrupted iterations
default   [  26% ] 10/10 VUs  1m17.7s/5m00.0s

running (1m19.0s), 10/10 VUs, 223 complete and 0 interrupted iterations
default   [  26% ] 10/10 VUs  1m18.7s/5m00.0s

running (1m20.0s), 10/10 VUs, 229 complete and 0 interrupted iterations
default   [  27% ] 10/10 VUs  1m19.7s/5m00.0s

running (1m21.0s), 10/10 VUs, 236 complete and 0 interrupted iterations
default   [  27% ] 10/10 VUs  1m20.7s/5m00.0s

running (1m22.0s), 10/10 VUs, 238 complete and 0 interrupted iterations
default   [  27% ] 10/10 VUs  1m21.7s/5m00.0s

running (1m23.0s), 10/10 VUs, 243 complete and 0 interrupted iterations
default   [  28% ] 10/10 VUs  1m22.7s/5m00.0s

running (1m24.0s), 10/10 VUs, 248 complete and 0 interrupted iterations
default   [  28% ] 10/10 VUs  1m23.7s/5m00.0s

running (1m25.0s), 10/10 VUs, 255 complete and 0 interrupted iterations
default   [  28% ] 10/10 VUs  1m24.7s/5m00.0s

running (1m26.0s), 10/10 VUs, 257 complete and 0 interrupted iterations
default   [  29% ] 10/10 VUs  1m25.7s/5m00.0s

running (1m27.0s), 10/10 VUs, 263 complete and 0 interrupted iterations
default   [  29% ] 10/10 VUs  1m26.7s/5m00.0s

running (1m28.0s), 10/10 VUs, 269 complete and 0 interrupted iterations
default   [  29% ] 10/10 VUs  1m27.7s/5m00.0s

running (1m29.0s), 10/10 VUs, 275 complete and 0 interrupted iterations
default   [  30% ] 10/10 VUs  1m28.7s/5m00.0s

running (1m30.0s), 10/10 VUs, 277 complete and 0 interrupted iterations
default   [  30% ] 10/10 VUs  1m29.7s/5m00.0s

running (1m31.0s), 10/10 VUs, 281 complete and 0 interrupted iterations
default   [  30% ] 10/10 VUs  1m30.7s/5m00.0s

running (1m32.0s), 10/10 VUs, 288 complete and 0 interrupted iterations
default   [  31% ] 10/10 VUs  1m31.7s/5m00.0s

running (1m33.0s), 10/10 VUs, 291 complete and 0 interrupted iterations
default   [  31% ] 10/10 VUs  1m32.7s/5m00.0s

running (1m34.0s), 10/10 VUs, 297 complete and 0 interrupted iterations
default   [  31% ] 10/10 VUs  1m33.7s/5m00.0s

running (1m35.0s), 10/10 VUs, 300 complete and 0 interrupted iterations
default   [  32% ] 10/10 VUs  1m34.7s/5m00.0s

running (1m36.0s), 10/10 VUs, 307 complete and 0 interrupted iterations
default   [  32% ] 10/10 VUs  1m35.7s/5m00.0s

running (1m37.0s), 10/10 VUs, 311 complete and 0 interrupted iterations
default   [  32% ] 10/10 VUs  1m36.7s/5m00.0s

running (1m38.0s), 10/10 VUs, 316 complete and 0 interrupted iterations
default   [  33% ] 10/10 VUs  1m37.7s/5m00.0s

running (1m39.0s), 10/10 VUs, 322 complete and 0 interrupted iterations
default   [  33% ] 10/10 VUs  1m38.7s/5m00.0s

running (1m40.0s), 10/10 VUs, 325 complete and 0 interrupted iterations
default   [  33% ] 10/10 VUs  1m39.7s/5m00.0s

running (1m41.0s), 10/10 VUs, 331 complete and 0 interrupted iterations
default   [  34% ] 10/10 VUs  1m40.7s/5m00.0s

running (1m42.0s), 10/10 VUs, 335 complete and 0 interrupted iterations
default   [  34% ] 10/10 VUs  1m41.7s/5m00.0s

running (1m43.0s), 10/10 VUs, 341 complete and 0 interrupted iterations
default   [  34% ] 10/10 VUs  1m42.7s/5m00.0s

running (1m44.0s), 10/10 VUs, 345 complete and 0 interrupted iterations
default   [  35% ] 10/10 VUs  1m43.7s/5m00.0s

running (1m45.0s), 10/10 VUs, 351 complete and 0 interrupted iterations
default   [  35% ] 10/10 VUs  1m44.7s/5m00.0s

running (1m46.0s), 10/10 VUs, 355 complete and 0 interrupted iterations
default   [  35% ] 10/10 VUs  1m45.7s/5m00.0s

running (1m47.0s), 10/10 VUs, 359 complete and 0 interrupted iterations
default   [  36% ] 10/10 VUs  1m46.7s/5m00.0s

running (1m48.0s), 10/10 VUs, 365 complete and 0 interrupted iterations
default   [  36% ] 10/10 VUs  1m47.7s/5m00.0s

running (1m49.0s), 10/10 VUs, 372 complete and 0 interrupted iterations
default   [  36% ] 10/10 VUs  1m48.7s/5m00.0s

running (1m50.0s), 10/10 VUs, 374 complete and 0 interrupted iterations
default   [  37% ] 10/10 VUs  1m49.7s/5m00.0s

running (1m51.0s), 10/10 VUs, 379 complete and 0 interrupted iterations
default   [  37% ] 10/10 VUs  1m50.7s/5m00.0s

running (1m52.0s), 10/10 VUs, 385 complete and 0 interrupted iterations
default   [  37% ] 10/10 VUs  1m51.7s/5m00.0s

running (1m53.0s), 10/10 VUs, 391 complete and 0 interrupted iterations
default   [  38% ] 10/10 VUs  1m52.7s/5m00.0s

running (1m54.0s), 10/10 VUs, 394 complete and 0 interrupted iterations
default   [  38% ] 10/10 VUs  1m53.7s/5m00.0s

running (1m55.0s), 10/10 VUs, 401 complete and 0 interrupted iterations
default   [  38% ] 10/10 VUs  1m54.7s/5m00.0s

running (1m56.0s), 10/10 VUs, 405 complete and 0 interrupted iterations
default   [  39% ] 10/10 VUs  1m55.7s/5m00.0s

running (1m57.0s), 10/10 VUs, 410 complete and 0 interrupted iterations
default   [  39% ] 10/10 VUs  1m56.7s/5m00.0s

running (1m58.0s), 10/10 VUs, 416 complete and 0 interrupted iterations
default   [  39% ] 10/10 VUs  1m57.7s/5m00.0s

running (1m59.0s), 10/10 VUs, 421 complete and 0 interrupted iterations
default   [  40% ] 10/10 VUs  1m58.7s/5m00.0s

running (2m00.0s), 10/10 VUs, 426 complete and 0 interrupted iterations
default   [  40% ] 10/10 VUs  1m59.7s/5m00.0s

running (2m01.0s), 10/10 VUs, 432 complete and 0 interrupted iterations
default   [  40% ] 10/10 VUs  2m00.7s/5m00.0s

running (2m02.0s), 10/10 VUs, 439 complete and 0 interrupted iterations
default   [  41% ] 10/10 VUs  2m01.7s/5m00.0s

running (2m03.0s), 10/10 VUs, 440 complete and 0 interrupted iterations
default   [  41% ] 10/10 VUs  2m02.7s/5m00.0s

running (2m04.0s), 10/10 VUs, 446 complete and 0 interrupted iterations
default   [  41% ] 10/10 VUs  2m03.7s/5m00.0s

running (2m05.0s), 10/10 VUs, 451 complete and 0 interrupted iterations
default   [  42% ] 10/10 VUs  2m04.7s/5m00.0s

running (2m06.0s), 10/10 VUs, 457 complete and 0 interrupted iterations
default   [  42% ] 10/10 VUs  2m05.7s/5m00.0s

running (2m07.0s), 10/10 VUs, 462 complete and 0 interrupted iterations
default   [  42% ] 10/10 VUs  2m06.7s/5m00.0s

running (2m08.0s), 10/10 VUs, 468 complete and 0 interrupted iterations
default   [  43% ] 10/10 VUs  2m07.7s/5m00.0s

running (2m09.0s), 10/10 VUs, 472 complete and 0 interrupted iterations
default   [  43% ] 10/10 VUs  2m08.7s/5m00.0s

running (2m10.0s), 10/10 VUs, 477 complete and 0 interrupted iterations
default   [  43% ] 10/10 VUs  2m09.7s/5m00.0s

running (2m11.0s), 10/10 VUs, 484 complete and 0 interrupted iterations
default   [  44% ] 10/10 VUs  2m10.7s/5m00.0s

running (2m12.0s), 10/10 VUs, 487 complete and 0 interrupted iterations
default   [  44% ] 10/10 VUs  2m11.7s/5m00.0s

running (2m13.0s), 10/10 VUs, 491 complete and 0 interrupted iterations
default   [  44% ] 10/10 VUs  2m12.7s/5m00.0s

running (2m14.0s), 10/10 VUs, 500 complete and 0 interrupted iterations
default   [  45% ] 10/10 VUs  2m13.7s/5m00.0s

running (2m15.0s), 10/10 VUs, 503 complete and 0 interrupted iterations
default   [  45% ] 10/10 VUs  2m14.7s/5m00.0s

running (2m16.0s), 10/10 VUs, 510 complete and 0 interrupted iterations
default   [  45% ] 10/10 VUs  2m15.7s/5m00.0s

running (2m17.0s), 10/10 VUs, 513 complete and 0 interrupted iterations
default   [  46% ] 10/10 VUs  2m16.7s/5m00.0s

running (2m18.0s), 10/10 VUs, 516 complete and 0 interrupted iterations
default   [  46% ] 10/10 VUs  2m17.7s/5m00.0s

running (2m19.0s), 10/10 VUs, 523 complete and 0 interrupted iterations
default   [  46% ] 10/10 VUs  2m18.7s/5m00.0s

running (2m20.0s), 10/10 VUs, 529 complete and 0 interrupted iterations
default   [  47% ] 10/10 VUs  2m19.7s/5m00.0s

running (2m21.0s), 10/10 VUs, 531 complete and 0 interrupted iterations
default   [  47% ] 10/10 VUs  2m20.7s/5m00.0s

running (2m22.0s), 10/10 VUs, 536 complete and 0 interrupted iterations
default   [  47% ] 10/10 VUs  2m21.7s/5m00.0s

running (2m23.0s), 10/10 VUs, 541 complete and 0 interrupted iterations
default   [  48% ] 10/10 VUs  2m22.7s/5m00.0s

running (2m24.0s), 10/10 VUs, 546 complete and 0 interrupted iterations
default   [  48% ] 10/10 VUs  2m23.7s/5m00.0s

running (2m25.0s), 10/10 VUs, 547 complete and 0 interrupted iterations
default   [  48% ] 10/10 VUs  2m24.7s/5m00.0s

running (2m26.0s), 10/10 VUs, 556 complete and 0 interrupted iterations
default   [  49% ] 10/10 VUs  2m25.7s/5m00.0s

running (2m27.0s), 10/10 VUs, 559 complete and 0 interrupted iterations
default   [  49% ] 10/10 VUs  2m26.7s/5m00.0s

running (2m28.0s), 10/10 VUs, 566 complete and 0 interrupted iterations
default   [  49% ] 10/10 VUs  2m27.7s/5m00.0s

running (2m29.0s), 10/10 VUs, 570 complete and 0 interrupted iterations
default   [  50% ] 10/10 VUs  2m28.7s/5m00.0s

running (2m30.0s), 10/10 VUs, 573 complete and 0 interrupted iterations
default   [  50% ] 10/10 VUs  2m29.7s/5m00.0s

running (2m31.0s), 10/10 VUs, 583 complete and 0 interrupted iterations
default   [  50% ] 10/10 VUs  2m30.7s/5m00.0s

running (2m32.0s), 10/10 VUs, 585 complete and 0 interrupted iterations
default   [  51% ] 10/10 VUs  2m31.7s/5m00.0s

running (2m33.0s), 10/10 VUs, 590 complete and 0 interrupted iterations
default   [  51% ] 10/10 VUs  2m32.7s/5m00.0s

running (2m34.0s), 10/10 VUs, 595 complete and 0 interrupted iterations
default   [  51% ] 10/10 VUs  2m33.7s/5m00.0s

running (2m35.0s), 10/10 VUs, 600 complete and 0 interrupted iterations
default   [  52% ] 10/10 VUs  2m34.7s/5m00.0s

running (2m36.0s), 10/10 VUs, 606 complete and 0 interrupted iterations
default   [  52% ] 10/10 VUs  2m35.7s/5m00.0s

running (2m37.0s), 10/10 VUs, 611 complete and 0 interrupted iterations
default   [  52% ] 10/10 VUs  2m36.7s/5m00.0s

running (2m38.0s), 10/10 VUs, 613 complete and 0 interrupted iterations
default   [  53% ] 10/10 VUs  2m37.7s/5m00.0s

running (2m39.0s), 10/10 VUs, 622 complete and 0 interrupted iterations
default   [  53% ] 10/10 VUs  2m38.7s/5m00.0s

running (2m40.0s), 10/10 VUs, 624 complete and 0 interrupted iterations
default   [  53% ] 10/10 VUs  2m39.7s/5m00.0s

running (2m41.0s), 10/10 VUs, 630 complete and 0 interrupted iterations
default   [  54% ] 10/10 VUs  2m40.7s/5m00.0s

running (2m42.0s), 10/10 VUs, 634 complete and 0 interrupted iterations
default   [  54% ] 10/10 VUs  2m41.7s/5m00.0s

running (2m43.0s), 10/10 VUs, 640 complete and 0 interrupted iterations
default   [  54% ] 10/10 VUs  2m42.7s/5m00.0s

running (2m44.0s), 10/10 VUs, 645 complete and 0 interrupted iterations
default   [  55% ] 10/10 VUs  2m43.7s/5m00.0s

running (2m45.0s), 10/10 VUs, 649 complete and 0 interrupted iterations
default   [  55% ] 10/10 VUs  2m44.7s/5m00.0s

running (2m46.0s), 10/10 VUs, 655 complete and 0 interrupted iterations
default   [  55% ] 10/10 VUs  2m45.7s/5m00.0s

running (2m47.0s), 10/10 VUs, 660 complete and 0 interrupted iterations
default   [  56% ] 10/10 VUs  2m46.7s/5m00.0s

running (2m48.0s), 10/10 VUs, 663 complete and 0 interrupted iterations
default   [  56% ] 10/10 VUs  2m47.7s/5m00.0s

running (2m49.0s), 10/10 VUs, 668 complete and 0 interrupted iterations
default   [  56% ] 10/10 VUs  2m48.7s/5m00.0s

running (2m50.0s), 10/10 VUs, 672 complete and 0 interrupted iterations
default   [  57% ] 10/10 VUs  2m49.7s/5m00.0s

running (2m51.0s), 10/10 VUs, 678 complete and 0 interrupted iterations
default   [  57% ] 10/10 VUs  2m50.7s/5m00.0s

running (2m52.0s), 10/10 VUs, 683 complete and 0 interrupted iterations
default   [  57% ] 10/10 VUs  2m51.7s/5m00.0s

running (2m53.0s), 10/10 VUs, 688 complete and 0 interrupted iterations
default   [  58% ] 10/10 VUs  2m52.7s/5m00.0s

running (2m54.0s), 10/10 VUs, 693 complete and 0 interrupted iterations
default   [  58% ] 10/10 VUs  2m53.7s/5m00.0s

running (2m55.0s), 10/10 VUs, 698 complete and 0 interrupted iterations
default   [  58% ] 10/10 VUs  2m54.7s/5m00.0s

running (2m56.0s), 10/10 VUs, 703 complete and 0 interrupted iterations
default   [  59% ] 10/10 VUs  2m55.7s/5m00.0s

running (2m57.0s), 10/10 VUs, 708 complete and 0 interrupted iterations
default   [  59% ] 10/10 VUs  2m56.7s/5m00.0s

running (2m58.0s), 10/10 VUs, 712 complete and 0 interrupted iterations
default   [  59% ] 10/10 VUs  2m57.7s/5m00.0s

running (2m59.0s), 10/10 VUs, 716 complete and 0 interrupted iterations
default   [  60% ] 10/10 VUs  2m58.7s/5m00.0s

running (3m00.0s), 10/10 VUs, 721 complete and 0 interrupted iterations
default   [  60% ] 10/10 VUs  2m59.7s/5m00.0s

running (3m01.0s), 10/10 VUs, 728 complete and 0 interrupted iterations
default   [  60% ] 10/10 VUs  3m00.7s/5m00.0s

running (3m02.0s), 10/10 VUs, 732 complete and 0 interrupted iterations
default   [  61% ] 10/10 VUs  3m01.7s/5m00.0s

running (3m03.0s), 10/10 VUs, 737 complete and 0 interrupted iterations
default   [  61% ] 10/10 VUs  3m02.7s/5m00.0s

running (3m04.0s), 10/10 VUs, 743 complete and 0 interrupted iterations
default   [  61% ] 10/10 VUs  3m03.7s/5m00.0s

running (3m05.0s), 10/10 VUs, 750 complete and 0 interrupted iterations
default   [  62% ] 10/10 VUs  3m04.7s/5m00.0s

running (3m06.0s), 10/10 VUs, 753 complete and 0 interrupted iterations
default   [  62% ] 10/10 VUs  3m05.7s/5m00.0s

running (3m07.0s), 10/10 VUs, 758 complete and 0 interrupted iterations
default   [  62% ] 10/10 VUs  3m06.7s/5m00.0s

running (3m08.0s), 10/10 VUs, 764 complete and 0 interrupted iterations
default   [  63% ] 10/10 VUs  3m07.7s/5m00.0s

running (3m09.0s), 10/10 VUs, 769 complete and 0 interrupted iterations
default   [  63% ] 10/10 VUs  3m08.7s/5m00.0s

running (3m10.0s), 10/10 VUs, 773 complete and 0 interrupted iterations
default   [  63% ] 10/10 VUs  3m09.7s/5m00.0s

running (3m11.0s), 10/10 VUs, 777 complete and 0 interrupted iterations
default   [  64% ] 10/10 VUs  3m10.7s/5m00.0s

running (3m12.0s), 10/10 VUs, 781 complete and 0 interrupted iterations
default   [  64% ] 10/10 VUs  3m11.7s/5m00.0s

running (3m13.0s), 10/10 VUs, 787 complete and 0 interrupted iterations
default   [  64% ] 10/10 VUs  3m12.7s/5m00.0s

running (3m14.0s), 10/10 VUs, 791 complete and 0 interrupted iterations
default   [  65% ] 10/10 VUs  3m13.7s/5m00.0s

running (3m15.0s), 10/10 VUs, 796 complete and 0 interrupted iterations
default   [  65% ] 10/10 VUs  3m14.7s/5m00.0s

running (3m16.0s), 10/10 VUs, 800 complete and 0 interrupted iterations
default   [  65% ] 10/10 VUs  3m15.7s/5m00.0s

running (3m17.0s), 10/10 VUs, 805 complete and 0 interrupted iterations
default   [  66% ] 10/10 VUs  3m16.7s/5m00.0s

running (3m18.0s), 10/10 VUs, 809 complete and 0 interrupted iterations
default   [  66% ] 10/10 VUs  3m17.7s/5m00.0s

running (3m19.0s), 10/10 VUs, 816 complete and 0 interrupted iterations
default   [  66% ] 10/10 VUs  3m18.7s/5m00.0s

running (3m20.0s), 10/10 VUs, 821 complete and 0 interrupted iterations
default   [  67% ] 10/10 VUs  3m19.7s/5m00.0s

running (3m21.0s), 10/10 VUs, 826 complete and 0 interrupted iterations
default   [  67% ] 10/10 VUs  3m20.7s/5m00.0s

running (3m22.0s), 10/10 VUs, 830 complete and 0 interrupted iterations
default   [  67% ] 10/10 VUs  3m21.7s/5m00.0s

running (3m23.0s), 10/10 VUs, 836 complete and 0 interrupted iterations
default   [  68% ] 10/10 VUs  3m22.7s/5m00.0s

running (3m24.0s), 10/10 VUs, 841 complete and 0 interrupted iterations
default   [  68% ] 10/10 VUs  3m23.7s/5m00.0s

running (3m25.0s), 10/10 VUs, 848 complete and 0 interrupted iterations
default   [  68% ] 10/10 VUs  3m24.7s/5m00.0s

running (3m26.0s), 10/10 VUs, 851 complete and 0 interrupted iterations
default   [  69% ] 10/10 VUs  3m25.7s/5m00.0s

running (3m27.0s), 10/10 VUs, 857 complete and 0 interrupted iterations
default   [  69% ] 10/10 VUs  3m26.7s/5m00.0s

running (3m28.0s), 10/10 VUs, 860 complete and 0 interrupted iterations
default   [  69% ] 10/10 VUs  3m27.7s/5m00.0s

running (3m29.0s), 10/10 VUs, 866 complete and 0 interrupted iterations
default   [  70% ] 10/10 VUs  3m28.7s/5m00.0s

running (3m30.0s), 10/10 VUs, 872 complete and 0 interrupted iterations
default   [  70% ] 10/10 VUs  3m29.7s/5m00.0s

running (3m31.0s), 10/10 VUs, 877 complete and 0 interrupted iterations
default   [  70% ] 10/10 VUs  3m30.7s/5m00.0s

running (3m32.0s), 10/10 VUs, 885 complete and 0 interrupted iterations
default   [  71% ] 10/10 VUs  3m31.7s/5m00.0s

running (3m33.0s), 10/10 VUs, 887 complete and 0 interrupted iterations
default   [  71% ] 10/10 VUs  3m32.7s/5m00.0s

running (3m34.0s), 10/10 VUs, 892 complete and 0 interrupted iterations
default   [  71% ] 10/10 VUs  3m33.7s/5m00.0s

running (3m35.0s), 10/10 VUs, 899 complete and 0 interrupted iterations
default   [  72% ] 10/10 VUs  3m34.7s/5m00.0s

running (3m36.0s), 10/10 VUs, 903 complete and 0 interrupted iterations
default   [  72% ] 10/10 VUs  3m35.7s/5m00.0s

running (3m37.0s), 10/10 VUs, 910 complete and 0 interrupted iterations
default   [  72% ] 10/10 VUs  3m36.7s/5m00.0s

running (3m38.0s), 10/10 VUs, 914 complete and 0 interrupted iterations
default   [  73% ] 10/10 VUs  3m37.7s/5m00.0s

running (3m39.0s), 10/10 VUs, 919 complete and 0 interrupted iterations
default   [  73% ] 10/10 VUs  3m38.7s/5m00.0s

running (3m40.0s), 10/10 VUs, 923 complete and 0 interrupted iterations
default   [  73% ] 10/10 VUs  3m39.7s/5m00.0s

running (3m41.0s), 10/10 VUs, 929 complete and 0 interrupted iterations
default   [  74% ] 10/10 VUs  3m40.7s/5m00.0s

running (3m42.0s), 10/10 VUs, 932 complete and 0 interrupted iterations
default   [  74% ] 10/10 VUs  3m41.7s/5m00.0s

running (3m43.0s), 10/10 VUs, 937 complete and 0 interrupted iterations
default   [  74% ] 10/10 VUs  3m42.7s/5m00.0s

running (3m44.0s), 10/10 VUs, 945 complete and 0 interrupted iterations
default   [  75% ] 10/10 VUs  3m43.7s/5m00.0s

running (3m45.0s), 10/10 VUs, 945 complete and 0 interrupted iterations
default   [  75% ] 10/10 VUs  3m44.7s/5m00.0s

running (3m46.0s), 10/10 VUs, 951 complete and 0 interrupted iterations
default   [  75% ] 10/10 VUs  3m45.7s/5m00.0s

running (3m47.0s), 10/10 VUs, 958 complete and 0 interrupted iterations
default   [  76% ] 10/10 VUs  3m46.7s/5m00.0s

running (3m48.0s), 10/10 VUs, 962 complete and 0 interrupted iterations
default   [  76% ] 10/10 VUs  3m47.7s/5m00.0s

running (3m49.0s), 10/10 VUs, 965 complete and 0 interrupted iterations
default   [  76% ] 10/10 VUs  3m48.7s/5m00.0s

running (3m50.0s), 10/10 VUs, 970 complete and 0 interrupted iterations
default   [  77% ] 10/10 VUs  3m49.7s/5m00.0s

running (3m51.0s), 10/10 VUs, 975 complete and 0 interrupted iterations
default   [  77% ] 10/10 VUs  3m50.7s/5m00.0s

running (3m52.0s), 10/10 VUs, 979 complete and 0 interrupted iterations
default   [  77% ] 10/10 VUs  3m51.7s/5m00.0s

running (3m53.0s), 10/10 VUs, 982 complete and 0 interrupted iterations
default   [  78% ] 10/10 VUs  3m52.7s/5m00.0s

running (3m54.0s), 10/10 VUs, 988 complete and 0 interrupted iterations
default   [  78% ] 10/10 VUs  3m53.7s/5m00.0s

running (3m55.0s), 10/10 VUs, 993 complete and 0 interrupted iterations
default   [  78% ] 10/10 VUs  3m54.7s/5m00.0s

running (3m56.0s), 10/10 VUs, 997 complete and 0 interrupted iterations
default   [  79% ] 10/10 VUs  3m55.7s/5m00.0s

running (3m57.0s), 10/10 VUs, 1004 complete and 0 interrupted iterations
default   [  79% ] 10/10 VUs  3m56.7s/5m00.0s

running (3m58.0s), 10/10 VUs, 1007 complete and 0 interrupted iterations
default   [  79% ] 10/10 VUs  3m57.7s/5m00.0s

running (3m59.0s), 10/10 VUs, 1015 complete and 0 interrupted iterations
default   [  80% ] 10/10 VUs  3m58.7s/5m00.0s

running (4m00.0s), 10/10 VUs, 1019 complete and 0 interrupted iterations
default   [  80% ] 10/10 VUs  3m59.7s/5m00.0s

running (4m01.0s), 10/10 VUs, 1023 complete and 0 interrupted iterations
default   [  80% ] 10/10 VUs  4m00.7s/5m00.0s

running (4m02.0s), 10/10 VUs, 1029 complete and 0 interrupted iterations
default   [  81% ] 10/10 VUs  4m01.7s/5m00.0s

running (4m03.0s), 10/10 VUs, 1032 complete and 0 interrupted iterations
default   [  81% ] 10/10 VUs  4m02.7s/5m00.0s

running (4m04.0s), 10/10 VUs, 1037 complete and 0 interrupted iterations
default   [  81% ] 10/10 VUs  4m03.7s/5m00.0s

running (4m05.0s), 10/10 VUs, 1044 complete and 0 interrupted iterations
default   [  82% ] 10/10 VUs  4m04.7s/5m00.0s

running (4m06.0s), 10/10 VUs, 1047 complete and 0 interrupted iterations
default   [  82% ] 10/10 VUs  4m05.7s/5m00.0s

running (4m07.0s), 10/10 VUs, 1051 complete and 0 interrupted iterations
default   [  82% ] 10/10 VUs  4m06.7s/5m00.0s

running (4m08.0s), 09/10 VUs, 1059 complete and 0 interrupted iterations
default   [  83% ] 09/10 VUs  4m07.7s/5m00.0s

running (4m09.0s), 09/10 VUs, 1062 complete and 0 interrupted iterations
default   [  83% ] 09/10 VUs  4m08.7s/5m00.0s

running (4m10.0s), 09/10 VUs, 1067 complete and 0 interrupted iterations
default   [  83% ] 09/10 VUs  4m09.7s/5m00.0s

running (4m11.0s), 09/10 VUs, 1071 complete and 0 interrupted iterations
default   [  84% ] 09/10 VUs  4m10.7s/5m00.0s

running (4m12.0s), 09/10 VUs, 1074 complete and 0 interrupted iterations
default   [  84% ] 09/10 VUs  4m11.7s/5m00.0s

running (4m13.0s), 08/10 VUs, 1079 complete and 0 interrupted iterations
default   [  84% ] 08/10 VUs  4m12.7s/5m00.0s

running (4m14.0s), 08/10 VUs, 1082 complete and 0 interrupted iterations
default   [  85% ] 08/10 VUs  4m13.7s/5m00.0s

running (4m15.0s), 08/10 VUs, 1085 complete and 0 interrupted iterations
default   [  85% ] 08/10 VUs  4m14.7s/5m00.0s

running (4m16.0s), 08/10 VUs, 1090 complete and 0 interrupted iterations
default   [  85% ] 08/10 VUs  4m15.7s/5m00.0s

running (4m17.0s), 08/10 VUs, 1094 complete and 0 interrupted iterations
default   [  86% ] 08/10 VUs  4m16.7s/5m00.0s

running (4m18.0s), 08/10 VUs, 1097 complete and 0 interrupted iterations
default   [  86% ] 08/10 VUs  4m17.7s/5m00.0s

running (4m19.0s), 08/10 VUs, 1103 complete and 0 interrupted iterations
default   [  86% ] 08/10 VUs  4m18.7s/5m00.0s

running (4m20.0s), 07/10 VUs, 1105 complete and 0 interrupted iterations
default   [  87% ] 07/10 VUs  4m19.7s/5m00.0s

running (4m21.0s), 07/10 VUs, 1111 complete and 0 interrupted iterations
default   [  87% ] 07/10 VUs  4m20.7s/5m00.0s

running (4m22.0s), 07/10 VUs, 1115 complete and 0 interrupted iterations
default   [  87% ] 07/10 VUs  4m21.7s/5m00.0s

running (4m23.0s), 07/10 VUs, 1117 complete and 0 interrupted iterations
default   [  88% ] 07/10 VUs  4m22.7s/5m00.0s

running (4m24.0s), 07/10 VUs, 1121 complete and 0 interrupted iterations
default   [  88% ] 07/10 VUs  4m23.7s/5m00.0s

running (4m25.0s), 07/10 VUs, 1125 complete and 0 interrupted iterations
default   [  88% ] 07/10 VUs  4m24.7s/5m00.0s

running (4m26.0s), 07/10 VUs, 1127 complete and 0 interrupted iterations
default   [  89% ] 07/10 VUs  4m25.7s/5m00.0s

running (4m27.0s), 06/10 VUs, 1129 complete and 0 interrupted iterations
default   [  89% ] 06/10 VUs  4m26.7s/5m00.0s

running (4m28.0s), 06/10 VUs, 1133 complete and 0 interrupted iterations
default   [  89% ] 06/10 VUs  4m27.7s/5m00.0s

running (4m29.0s), 06/10 VUs, 1138 complete and 0 interrupted iterations
default   [  90% ] 06/10 VUs  4m28.7s/5m00.0s

running (4m30.0s), 06/10 VUs, 1141 complete and 0 interrupted iterations
default   [  90% ] 06/10 VUs  4m29.7s/5m00.0s

running (4m31.0s), 06/10 VUs, 1143 complete and 0 interrupted iterations
default   [  90% ] 06/10 VUs  4m30.7s/5m00.0s

running (4m32.0s), 05/10 VUs, 1146 complete and 0 interrupted iterations
default   [  91% ] 05/10 VUs  4m31.7s/5m00.0s

running (4m33.0s), 05/10 VUs, 1148 complete and 0 interrupted iterations
default   [  91% ] 05/10 VUs  4m32.7s/5m00.0s

running (4m34.0s), 05/10 VUs, 1151 complete and 0 interrupted iterations
default   [  91% ] 05/10 VUs  4m33.7s/5m00.0s

running (4m35.0s), 05/10 VUs, 1154 complete and 0 interrupted iterations
default   [  92% ] 05/10 VUs  4m34.7s/5m00.0s

running (4m36.0s), 05/10 VUs, 1154 complete and 0 interrupted iterations
default   [  92% ] 05/10 VUs  4m35.7s/5m00.0s

running (4m37.0s), 05/10 VUs, 1157 complete and 0 interrupted iterations
default   [  92% ] 05/10 VUs  4m36.7s/5m00.0s

running (4m38.0s), 04/10 VUs, 1160 complete and 0 interrupted iterations
default   [  93% ] 04/10 VUs  4m37.7s/5m00.0s

running (4m39.0s), 04/10 VUs, 1161 complete and 0 interrupted iterations
default   [  93% ] 04/10 VUs  4m38.7s/5m00.0s

running (4m40.0s), 04/10 VUs, 1163 complete and 0 interrupted iterations
default   [  93% ] 04/10 VUs  4m39.7s/5m00.0s

running (4m41.0s), 04/10 VUs, 1165 complete and 0 interrupted iterations
default   [  94% ] 04/10 VUs  4m40.7s/5m00.0s

running (4m42.0s), 04/10 VUs, 1167 complete and 0 interrupted iterations
default   [  94% ] 04/10 VUs  4m41.7s/5m00.0s

running (4m43.0s), 04/10 VUs, 1169 complete and 0 interrupted iterations
default   [  94% ] 04/10 VUs  4m42.7s/5m00.0s

running (4m44.0s), 04/10 VUs, 1172 complete and 0 interrupted iterations
default   [  95% ] 04/10 VUs  4m43.7s/5m00.0s

running (4m45.0s), 03/10 VUs, 1174 complete and 0 interrupted iterations
default   [  95% ] 03/10 VUs  4m44.7s/5m00.0s

running (4m46.0s), 03/10 VUs, 1176 complete and 0 interrupted iterations
default   [  95% ] 03/10 VUs  4m45.7s/5m00.0s

running (4m47.0s), 03/10 VUs, 1177 complete and 0 interrupted iterations
default   [  96% ] 03/10 VUs  4m46.7s/5m00.0s

running (4m48.0s), 03/10 VUs, 1179 complete and 0 interrupted iterations
default   [  96% ] 03/10 VUs  4m47.7s/5m00.0s

running (4m49.0s), 02/10 VUs, 1181 complete and 0 interrupted iterations
default   [  96% ] 02/10 VUs  4m48.7s/5m00.0s

running (4m50.0s), 02/10 VUs, 1183 complete and 0 interrupted iterations
default   [  97% ] 02/10 VUs  4m49.7s/5m00.0s

running (4m51.0s), 02/10 VUs, 1183 complete and 0 interrupted iterations
default   [  97% ] 02/10 VUs  4m50.7s/5m00.0s

running (4m52.0s), 02/10 VUs, 1183 complete and 0 interrupted iterations
default   [  97% ] 02/10 VUs  4m51.7s/5m00.0s

running (4m53.0s), 02/10 VUs, 1185 complete and 0 interrupted iterations
default   [  98% ] 02/10 VUs  4m52.7s/5m00.0s

running (4m54.0s), 02/10 VUs, 1186 complete and 0 interrupted iterations
default   [  98% ] 02/10 VUs  4m53.7s/5m00.0s

running (4m55.0s), 02/10 VUs, 1187 complete and 0 interrupted iterations
default   [  98% ] 02/10 VUs  4m54.7s/5m00.0s

running (4m56.0s), 01/10 VUs, 1189 complete and 0 interrupted iterations
default   [  99% ] 01/10 VUs  4m55.7s/5m00.0s

running (4m57.0s), 01/10 VUs, 1189 complete and 0 interrupted iterations
default   [  99% ] 01/10 VUs  4m56.7s/5m00.0s

running (4m58.0s), 01/10 VUs, 1190 complete and 0 interrupted iterations
default   [  99% ] 01/10 VUs  4m57.7s/5m00.0s

running (4m59.0s), 01/10 VUs, 1190 complete and 0 interrupted iterations
default   [ 100% ] 01/10 VUs  4m58.7s/5m00.0s

running (5m00.0s), 01/10 VUs, 1190 complete and 0 interrupted iterations
default   [ 100% ] 01/10 VUs  4m59.7s/5m00.0s
time="2026-05-04T09:03:24+03:00" level=info msg="ظ£à Load test completed" source=console


  ظûê THRESHOLDS 

    errors
    ظ£ô 'rate<0.01' rate=0.00%

    http_req_duration
    ظ£ô 'p(95)<200' p(95)=75.98ms

    http_reqs
    ظ£ù 'rate>50' rate=5.009533/s


  ظûê TOTAL RESULTS 

    checks_total.......: 2382    7.92871/s
    checks_succeeded...: 100.00% 2382 out of 2382
    checks_failed......: 0.00%   0 out of 2382

    ظ£ô Read: status 200
    ظ£ô Read: has id
    ظ£ô List: status 200
    ظ£ô List: has items
    ظ£ô Create: status 200/201
    ظ£ô Create: has id

    CUSTOM
    errors.........................: 0.00%  0 out of 1191
    latency........................: avg=32.773676 min=8.3249 med=26.5676 max=208.4963 p(90)=56.6062 p(95)=78.1626

    HTTP
    http_req_duration..............: avg=31.38ms   min=7.63ms med=24.44ms max=1.17s    p(90)=54.15ms p(95)=75.98ms
      { expected_response:true }...: avg=31.38ms   min=7.63ms med=24.44ms max=1.17s    p(90)=54.15ms p(95)=75.98ms
    http_req_failed................: 0.00%  0 out of 1505
    http_reqs......................: 1505   5.009533/s

    EXECUTION
    iteration_duration.............: avg=2.04s     min=1.02s  med=2.07s   max=4.08s    p(90)=2.82s   p(95)=2.93s  
    iterations.....................: 1191   3.964355/s
    vus............................: 1      min=1         max=10
    vus_max........................: 10     min=10        max=10

    NETWORK
    data_received..................: 6.0 MB 20 kB/s
    data_sent......................: 146 kB 487 B/s



running (5m00.4s), 00/10 VUs, 1191 complete and 0 interrupted iterations
default ظ£ô [ 100% ] 00/10 VUs  5m0s
time="2026-05-04T09:03:24+03:00" level=error msg="thresholds on metrics 'http_reqs' have been crossed"